Examples/FromPresentations/OFW8_landspeedersInCanyon/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    //- Define inlet conditions
    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "canyon.+"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

   "landSpeeder.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "landSpeeder.*_inlet"
    {
        $outlet;
    }

    "landSpeeder.*_outlet"
    {
        type groovyBC;
        value $internalField;
        variables (
            "kIn{inlet}=sum(area()*k)/sum(area());"
        );
        valueExpression "50*kIn";
    }

     sky
    {
        type slip;
    }
}


// ************************************************************************* //
