Examples/FromPresentations/OFW8_landspeedersInCanyon/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "canyon.+"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "landSpeeder.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "landSpeeder.*_inlet"
    {
        $outlet;
    }

    "landSpeeder.*_outlet"
    {
        type groovyBC;
        value $internalField;
        variables (
            "oIn{inlet}=sum(area()*omega)/sum(area());"
        );
        valueExpression "50*oIn";
    }

    sky {
        type slip;
    }
}


// ************************************************************************* //
